[Killed] ArithmeticOperator
git/y/lib/builtins.js:2:55
 module.exports = {
-  "+": ({ "+": els }, env, y) => els.reduce((a, b) => a + y(b, env), 0),
+  "+": ({ "+": els }, env, y) => els.reduce((a, b) => a - y(b, env), 0),
   and: ({ and: value }, env, y) => y(value, env),
   quote: ({ quote: value }, env, y) => value,

[Killed] ArrowFunction
git/y/lib/builtins.js:2:45
 module.exports = {
-  "+": ({ "+": els }, env, y) => els.reduce((a, b) => a + y(b, env), 0),
+  "+": ({ "+": els }, env, y) => els.reduce(() => undefined, 0),
   and: ({ and: value }, env, y) => y(value, env),
   quote: ({ quote: value }, env, y) => value,

[Killed] ArrowFunction
git/y/lib/builtins.js:3:8
 module.exports = {
   "+": ({ "+": els }, env, y) => els.reduce((a, b) => a + y(b, env), 0),
-  and: ({ and: value }, env, y) => y(value, env),
+  and: () => undefined,
   quote: ({ quote: value }, env, y) => value,
   lambda: ({ lambda: param, ...block }, env, y) => (arg) =>

[Killed] ArrowFunction
git/y/lib/builtins.js:4:10
 module.exports = {
   "+": ({ "+": els }, env, y) => els.reduce((a, b) => a + y(b, env), 0),
   and: ({ and: value }, env, y) => y(value, env),
-  quote: ({ quote: value }, env, y) => value,
+  quote: () => undefined,
   lambda: ({ lambda: param, ...block }, env, y) => (arg) =>
     y(block, { ...env, [param]: arg }),

[Survived] ArrowFunction
git/y/lib/builtins.js:5:11
   "+": ({ "+": els }, env, y) => els.reduce((a, b) => a + y(b, env), 0),
   and: ({ and: value }, env, y) => y(value, env),
   quote: ({ quote: value }, env, y) => value,
-  lambda: ({ lambda: param, ...block }, env, y) => (arg) =>
-    y(block, { ...env, [param]: arg }),
+  lambda: () => undefined,
   call: ({ call: fn, with: arg }, env, y) => y(fn, env)(arg),
 };

[NoCoverage] ArrowFunction
git/y/lib/builtins.js:5:52
   "+": ({ "+": els }, env, y) => els.reduce((a, b) => a + y(b, env), 0),
   and: ({ and: value }, env, y) => y(value, env),
   quote: ({ quote: value }, env, y) => value,
-  lambda: ({ lambda: param, ...block }, env, y) => (arg) =>
-    y(block, { ...env, [param]: arg }),
+  lambda: ({ lambda: param, ...block }, env, y) => () => undefined,
   call: ({ call: fn, with: arg }, env, y) => y(fn, env)(arg),
 };

[Survived] ArrowFunction
git/y/lib/builtins.js:7:9
   quote: ({ quote: value }, env, y) => value,
   lambda: ({ lambda: param, ...block }, env, y) => (arg) =>
     y(block, { ...env, [param]: arg }),
-  call: ({ call: fn, with: arg }, env, y) => y(fn, env)(arg),
+  call: () => undefined,
 };
 
