[Killed] ArrowFunction
git/y/lib/index.js:1:12
-const ID = (x) => x;
+const ID = () => undefined;
 const EVAL = {
   object(x, env, y) {

[Killed] BlockStatement
git/y/lib/index.js:3:21
 const ID = (x) => x;
 const EVAL = {
-  object(x, env, y) {
-    if (x === null) return null;
-    const key = Object.keys(x)[0];
-    if (!(key in env)) throw new ReferenceError(`${key} is not defined`);
-    return env[key](x, env, y);
-  },
+  object(x, env, y) {},
   string(x, env, y) {
     return env[x];

[Killed] EqualityOperator
git/y/lib/index.js:4:9
 const ID = (x) => x;
 const EVAL = {
   object(x, env, y) {
-    if (x === null) return null;
+    if (x !== null) return null;
     const key = Object.keys(x)[0];
     if (!(key in env)) throw new ReferenceError(`${key} is not defined`);

[Killed] ConditionalExpression
git/y/lib/index.js:4:9
 const ID = (x) => x;
 const EVAL = {
   object(x, env, y) {
-    if (x === null) return null;
+    if (false) return null;
     const key = Object.keys(x)[0];
     if (!(key in env)) throw new ReferenceError(`${key} is not defined`);

[Killed] ConditionalExpression
git/y/lib/index.js:6:9
   object(x, env, y) {
     if (x === null) return null;
     const key = Object.keys(x)[0];
-    if (!(key in env)) throw new ReferenceError(`${key} is not defined`);
+    if (true) throw new ReferenceError(`${key} is not defined`);
     return env[key](x, env, y);
   },

[Killed] ConditionalExpression
git/y/lib/index.js:6:9
   object(x, env, y) {
     if (x === null) return null;
     const key = Object.keys(x)[0];
-    if (!(key in env)) throw new ReferenceError(`${key} is not defined`);
+    if (false) throw new ReferenceError(`${key} is not defined`);
     return env[key](x, env, y);
   },

[NoCoverage] BlockStatement
git/y/lib/index.js:9:21
     if (!(key in env)) throw new ReferenceError(`${key} is not defined`);
     return env[key](x, env, y);
   },
-  string(x, env, y) {
-    return env[x];
-  },
+  string(x, env, y) {},
 };
 const y = (x, env = require("./builtins.js")) =>

[Killed] ArrowFunction
git/y/lib/index.js:13:11
     return env[x];
   },
 };
-const y = (x, env = require("./builtins.js")) =>
-  (EVAL[typeof x] || ID)(x, env, y);
+const y = () => undefined;
 
 module.exports = y;

[Killed] ConditionalExpression
git/y/lib/index.js:14:4
   },
 };
 const y = (x, env = require("./builtins.js")) =>
-  (EVAL[typeof x] || ID)(x, env, y);
+  (false)(x, env, y);
 
 module.exports = y;

[Killed] ConditionalExpression
git/y/lib/index.js:14:4
   },
 };
 const y = (x, env = require("./builtins.js")) =>
-  (EVAL[typeof x] || ID)(x, env, y);
+  (true)(x, env, y);
 
 module.exports = y;
